Repository: mbits-libs/git2-cxx
Catalog: data/translations/errors/*.po
Languages: pl

# BRANCH_EXISTS
source: branch '{}' already exists
pl: gałąź „{}” już istnieje

# BRANCH_NAME_INVALID
source: '{}' is not a valid branch name
pl: „{}” nie jest prawidłową nazwą gałęzi

# BRANCH_NOT_DELETABLE
source: cannot delete branch '{0}' selected in '{1}'
pl: nie można usunąć gałęzi „{0}” wybranej w „{1}”

# CONFIG_CANNOT_DELETE
source: could not find key '{}' to delete
pl: nie można odnaleźć klucza „{}” do usunięcia

# CONFIG_INVALID_NAME
source: invalid config item name '{}'
pl: nieprawidłowa nazwa elementu konfiguracji „{}”

# CONFIG_NON_UNIQUE_INCLUDED
source: entry is not unique due to being included
pl: wpis nie jest unikalny ze względu na to, że został załączony

# CONFIG_NON_UNIQUE_MULTIVAR
source: entry is not unique due to being a multivar
pl: wpis nie jest unikalny ze względu na to, że jest zmienną wielokrotną

# DOMAIN_ERROR_MSG
source: {0}: {1} error: {2}
pl: {0}: błąd {1}: {2}

# SHOW_EMPTY_HEAD
source: HEAD refers to branch with no reports
pl: HEAD odnosi się do gałęzi bez raportów

# SHOW_INVALID_PATTERN
source: invalid pattern '{}'
pl: nieprawidłowy wzorzec '{}'

# SHOW_NOT_FOUND
source: requested object could not be found
pl: nie można odnaleźć żądanego obiektu

# TAG_EXISTS
source: tag '{}' already exists
pl: znacznik „{}” już istnieje

# TAG_NAME_INVALID
source: '{}' is not a valid tag name
pl: „{}” nie jest prawidłową nazwą znacznika
