Repository: mbits-libs/git2-cxx
Catalog: data/translations/*.po
Languages: pl

# args.CANNOT_FIND_COV
source: Cannot find a Cov repository in {0}
pl: Nie można znaleźć repozytorium Cov w {0}

# args.DIR_META
source: <dir>
pl: <katalog>

# args.ERROR_MSG
source: {0}: error: {1}
pl: {0}: błąd: {1}

# args.EXCLUSIVE
source: not allowed with argument {0}
pl: nie można używać z {0}

# args.FILE_META
source: <file>
pl: <plik>

# args.FILE_NOT_FOUND
source: cannot open {0}
pl: nie można otworzyć {0}

# args.HELP_DESCRIPTION
source: shows this help message and exits
pl: pokazuje ten komunikat pomocy i wychodzi

# args.NAME_META
source: <name>
pl: <nazwa>

# args.NEEDED_NUMBER_EXCEEDED
source: argument {0}: number outside of expected bounds
pl: argument {0}: liczba poza oczekiwanym zakresem

# args.NEEDS_ENUM_KNOWN_VALUES
source: known values for {0}: {1}
pl: znane wartości dla {0}: {1}

# args.NEEDS_ENUM_UNKNOWN
source: argument {0}: value {1} is not recognized
pl: argument {0}: wartość {1} jest nierozpoznana

# args.NEEDS_NO_PARAM
source: argument {0}: value was not expected
pl: argument {0}: wartość nie była oczekiwana

# args.NEEDS_NUMBER
source: argument {0}: expected a number
pl: argument {0}: oczekiwano liczby

# args.NEEDS_PARAM
source: argument {0}: expected one argument
pl: argument {0}: oczekiwano jednego argumentu

# args.OPTIONALS
source: optional arguments
pl: argumenty opcjonalne

# args.PATH_META
source: <path>
pl: <ścieżka>

# args.POSITIONALS
source: positional arguments
pl: argumenty pozycyjne

# args.REQUIRED
source: argument {0} is required
pl: argument {0} jest wymagany

# args.UNRECOGNIZED
source: unrecognized argument: {0}
pl: nierozpoznany argument: {0}

# args.USAGE
source: usage:
pl: użycie:

# args.VALUE_META
source: <value>
pl: <wartość>

# cov.CWD_DESCRIPTION
source: runs as if cov was started in <dir> instead of the current working directory
pl: działa tak, jakby cov został uruchomiony w <katalogu> zamiast bieżącym katalogu roboczym

# cov.DESCRIPTION
source: Cov for Windows
pl: Cov dla Windows

# cov.ERROR_ALIAS
source: empty alias for '{}'
pl: pusty alias dla '{}'

# cov.ERROR_TOOL_NOT_RECOGNIZED
source: "{}" is not a cov command
pl: "{}" nie jest poleceniem cov

# cov.HELP_ALIAS
source: '{}' is aliased to '{}'
pl: '{}' jest aliasem '{}'

# cov.HELP_DESCRIPTION_ADD
source: appends a report to repo
pl: dołącza raport do repozytorium

# cov.HELP_DESCRIPTION_CONFIG
source: shows and/or sets various settings
pl: pokazuje i/lub ustawia różne ustawienia

# cov.HELP_DESCRIPTION_INIT
source: creates a new cov repo
pl: tworzy nowe repozytorium cov

# cov.HELP_DESCRIPTION_LOG
source: prints a list of reports
pl: drukuje listę raportów

# cov.HELP_DESCRIPTION_MODULE
source: defines file groups
pl: definiuje grupy plików

# cov.HELP_DESCRIPTION_REMOVE
source: removes a particular report from repo
pl: usuwa określony raport z repozytorium

# cov.HELP_DESCRIPTION_SERVE
source: starts a local webserver with reports
pl: uruchamia lokalny serwer WWW raportów

# cov.HELP_DESCRIPTION_SHOW
source: shows a specific report
pl: pokazuje konkretny raport

# cov.HELP_GROUP_COMMON
source: common commands
pl: typowe polecenia

# cov.LIST_CMDS_DESCRIPTION
source: lists known commands from requested groups
pl: wyświetla listę znanych poleceń z żądanych grup

# cov.USAGE
source: [-h] [-C <dir>] <command> [<args>]
pl: [-h] [-C <katalog>] <polecenie> [<argumenty>]

# cov.VERSION_DESCRIPTION
source: shows version information and exits
pl: wyświetla informacje o wersji i wychodzi

# cov.VERSION_IS
source: cov version {}
pl: cov wersja {}

# cov_config.ADD
source: adds a new line to the option without altering any existing values
pl: dodaje nowy wiersz do opcji bez zmieniania istniejących wartości

# cov_config.ADD_VALUE_MISSING
source: needs both <name> and <value>
pl: potrzebuje zarówno <nazwy>, jak i <wartości>

# cov_config.GET
source: prints the value matching the key name
pl: drukuje wartość odpowiadającej nazwie klucza

# cov_config.GET_ALL
source: prints all values matching the key name
pl: drukuje wszystkie wartości pasujące do nazwy klucza

# cov_config.LIST_ENTRIES
source: lists all variables in a config files
pl: wyświetla listę wszystkich zmiennych w plikach konfiguracyjnych

# cov_config.NAME_VALUE
source: when only name is given, reads its value; otherwise sets the new value
pl: gdy podana jest tylko nazwa, odczytuje jej wartość; w przeciwnym razie ustawia nową wartość

# cov_config.NO_SCOPE_DESCRIPTION
source: reads from all visible scopes at once, writes to .covdata/config
pl: odczytuje ze wszystkich dostępnych plików jednocześnie, zapisuje do .covdata/config

# cov_config.NO_SCOPE_META
source: <no option>
pl: <brak opcji>

# cov_config.SCOPE_FILE
source: chooses given file
pl: wybiera podany plik

# cov_config.SCOPE_GLOBAL
source: chooses ~/.config/cov/config
pl: wybiera ~/.config/cov/config

# cov_config.SCOPE_LOCAL
source: chooses .covdata/config
pl: wybiera .covdata/config

# cov_config.SCOPE_META
source: <file-options>
pl: <opcje-pliku>

# cov_config.SCOPE_SYSTEM
source: chooses $(prefix)/etc/covconfig
pl: wybiera $(prefix)/etc/covconfig

# cov_config.SCOPE_TITLE
source: file options
pl: opcje pliku

# cov_config.TOO_MANY_ARGUMENTS
source: too many arguments
pl: zbyt wiele argumentów

# cov_config.UNSET
source: removes the value matching the key name if there is exactly one
pl: usuwa wartość pasującą do nazwy klucza, jeśli istnieje dokładnie jedna

# cov_config.UNSET_ALL
source: removes all values matching the key name
pl: usuwa wszystkie wartości pasujące do nazwy klucza

# cov_init.ARG_DIRECTORY
source: sets the directory to put the repository in; defaults to current directory
pl: ustawia katalog, w którym ma zostać umieszczone repozytorium; domyślnie wybiera bieżący katalog

# cov_init.ARG_FORCE
source: will re-init the repository with a fresh database
pl: ponownie zainicjuje repozytorium ze świeżą bazą danych

# cov_init.ARG_GITDIR
source: points to connected Git repository; defaults to current repo
pl: wskazuje na połączone repozytorium Git; domyślnie wybiera bieżące repozytorium

# cov_init.CANNOT_INITIALIZE
source: Cannot initialize Cov repository in {0}
pl: Nie można zainicjować repozytorium Cov w {0}

# cov_init.CANNOT_REMOVE
source: Cannot remove Cov repository in {0}
pl: Nie można usunąć repozytorium Cov w {0}

# cov_init.DIR_META
source: directory
pl: katalog

# cov_init.EXISTS
source: Cov repository already exists in {0}
pl: Repozytorium Cov już istnieje w {0}

# cov_init.INITIALIZED
source: Initialized empty Cov repository in {0}
pl: Zainicjowano puste repozytorium Cov w {0}

# cov_init.NOT_GIT
source: not git repo: {0}
pl: nie repo gita: {0}

# cov_init.REINITIALIZED
source: Reinitialized empty Cov repository in {0}
pl: Ponownie zainicjowano puste repozytorium Cov w {0}

# cov_init.USING_GIT
source: Using Git repository in {0}
pl: Używając repozytorium Git w {0}

# cov_module.ADD_DESCRIPTION
source: adds a directory filter to a new or existing module
pl: dodaje filtr katalogu do nowego lub istniejącego modułu

# cov_module.COMMIT_META
source: <git-commit>
pl: <zapis-gita>

# cov_module.ERROR_ADD_DUPLICATE
source: module {} already contains directory {}
pl: moduł {} zawiera już katalog {}

# cov_module.ERROR_EXCLUSIVE
source: {} argument cannot be used with other options
pl: argument {} nie może być używany z innymi opcjami

# cov_module.ERROR_NO_GIT_REPO
source: cannot find Git repository in {}
pl: nie można znaleźć repozytorium Git w {}

# cov_module.ERROR_NO_GIT_WORKDIR
source: this operation must be run in a work tree
pl: ta operacja musi być uruchomiona w drzewie roboczym

# cov_module.ERROR_OPTS_NEEDS_AT_LEAST
source: {} argument needs at least {} argument
pl: argument {} wymaga co najmniej jednego argumentu

# cov_module.ERROR_OPTS_NEEDS_AT_MOST
source: {} argument needs at most {} argument
pl: {} argument wymaga co najwyżej jednego argumentu

# cov_module.ERROR_OPTS_NEEDS_EXACTLY
source: {} argument needs exactly {} argument
pl: argument {} wymaga dokładnie jednego argumentu

# cov_module.ERROR_REMOVE_NO_MODULE
source: there is no {} module
pl: nie ma modułu {}

# cov_module.ERROR_REVPARSE_NEEDS_COMMIT
source: <git-commit> argument should describe a commit
pl: argument <zapis-gita> powinien opisywać złożony zapis

# cov_module.ERROR_REVPARSE_NEEDS_SINGLE
source: <git-commit> argument should describe a single object
pl: argument <zapis-gita> powinien opisywać pojedynczy obiekt

# cov_module.NOARGS_META
source: no arguments
pl: brak_argumentów

# cov_module.REMOVA_ALL_DESCRIPTION
source: removes all filters from the module, effectively removing it
pl: usuwa wszystkie filtry z modułu, w efekcie go usuwając

# cov_module.REMOVE_DESCRIPTION
source: removes a directory filter from given module
pl: usuwa filtr katalogu z danego modułu

# cov_module.SET_SEP_DESCRIPTION
source: sets new module name separator
pl: ustawia nowy separator nazw modułów

# cov_module.SHOW_COMMIT_DESCRIPTION
source: prints module list for given commit and exits
pl: drukuje listę modułów dla danego zapisu i wychodzi

# cov_module.SHOW_SEP_DESCRIPTION
source: prints module name separator from either workdir or commit
pl: drukuje separator nazwy modułu albo z katalogu roboczego, albo z zapisu

# cov_module.SHOW_WORKDIR_DESCRIPTION
source: prints module list from git work directory and exits
pl: drukuje listę modułów z katalogu roboczego git i wychodzi

# errors.CONFIG_CANNOT_DELETE
source: could not find key '{}' to delete
pl: nie można odnaleźć klucza „{}” do usunięcia

# errors.CONFIG_INVALID_NAME
source: invalid config item name '{}'
pl: nieprawidłowa nazwa elementu konfiguracji „{}”

# errors.CONFIG_NON_UNIQUE_INCLUDED
source: entry is not unique due to being included
pl: wpis nie jest unikalny ze względu na to, że został załączony

# errors.CONFIG_NON_UNIQUE_MULTIVAR
source: entry is not unique due to being a multivar
pl: wpis nie jest unikalny ze względu na to, że jest zmienną wielokrotną

# errors.DOMAIN_ERROR_MSG
source: {0}: {1} error: {2}
pl: {0}: błąd {1}: {2}
