Repository: mbits-libs/git2-cxx
Catalog: data/translations/cov_log/*.po
Languages: pl

# ABBREV_HASH_DESCRIPTION
source: instead of showing the full 40-byte hexadecimal report object name, shows a prefix that names the objects uniquely
pl: zamiast wyświetlać pełną 40-bajtową szesnastkową nazwę obiektu raportu, pokazuje prefiks, który nazywa obiekty jednoznacznie

# FORMAT_DESCRIPTION
source: pretty-prints the contents of the report logs in a given format, where <format> can be one of 'oneline', 'short', 'medium', 'full', 'fuller', 'reference', 'raw' and 'pretty:<string>'; when <format> is none of the above, and has %placeholder in it, it acts as if --format=pretty:<format> were given
pl: wyświetla zawartość dzienników raportu w danym formacie, gdzie <format> może być jednym z „oneline”, „short”, „medium”, „full”, „fuller”, „reference”, „raw” i „pretty:<string>”; gdy <format> nie jest żadnym z powyższych i zawiera %symbol zastępczy, działa tak, jakby zostało wywołane --format=pretty:<format>

# HOW_DESCRIPTION
source: prints out ref names of any reports that are shown; <how> is 'short', 'auto', or 'no'
pl: drukuje referencje wyświetlanych raportów; <jak> jest jednym z „short” (krótkie), „auto” lub „no” (nie)

# HOW_META
source: <how>
pl: <jak>

# MAX_COUNT_DESCRIPTION
source: limits the number of reports to output
pl: ogranicza liczbę raportów do wydrukowania

# NO_ABBREV_HASH_DESCRIPTION
source: shows the full 40-byte hexadecimal report object name
pl: pokazuje pełną 40-bajtową szesnastkową nazwę obiektu raportu

# NO_PROP_NAMES_DESCRIPTION
source: shows string build properties without property names; since boolean flags and numbers do not convey meaning, they are still shown with property names
pl: pokazuje właściwości kompilacji, które są ciągami znaków, bez nazw właściwości; ponieważ flagi logiczne i liczby nie przekazują znaczenia, są nadal wyświetlane z nazwami właściwości

# NUMBER_META
source: <number>
pl: <liczba>

# ONELINE_DESCRIPTION
source: a shorthand for "--format=oneline --abbrev-hash" used together
pl: skrót użytych jednocześnie "--format=oneline --abbrev-hash"

# PROP_NAMES_DESCRIPTION
source: shows all build properties with property names
pl: pokazuje wszystkie właściwości kompilacji z nazwami właściwości

# REV_RANGE_DESCRIPTION
source: shows only reports in the specified revision range
pl: pokazuje tylko raporty z określonego zakresu rewizji

# REV_RANGE_META
source: <revision-range>
pl: <zakres-rewizji>

# WHEN_DESCRIPTION
source: uses color in output; <when> is 'never', 'always', or 'auto'
pl: używa koloru na wyjściu; <kiedy> jest jednym z „never” (nigdy), „always” (zawsze) lub „auto”

# WHEN_META
source: <when>
pl: <kiedy>
