Repository: mbits-libs/git2-cxx
Catalog: data/translations/cov_refs/*.po
Languages: pl

# BRANCH_DELETE_DESCRIPTION
source: deletes existing branches with given names
pl: usuwa istniejące gałęzie o podanych nazwach

# BRANCH_FORCE_DESCRIPTION
source: forces creation of new branch even, if it already exists
pl: wymusza utworzenie nowej gałęzi nawet, jeśli ta już istnieje

# BRANCH_LIST_DESCRIPTION
source: lists known branches; if any shell wildcard pattern is present, it only shows branches matching the pattern(s); when multiple patterns are given, if any of them matches, the branch is shown
pl: wymienia znane gałęzie; jeśli istnieje jakikolwiek wzorzec z symbolem wieloznacznym powłoki, pokazuje tylko gałęzie pasujące do wzorca (wzorców); gdy podano wiele wzorów, jeśli którykolwiek z nich pasuje, gałąź jest wyświetlana

# BRANCH_NAME_DESCRIPTION
source: creates a new branch with given name; if the branch already exists, this command will fail
pl: tworzy nową gałąź o podanej nazwie; jeśli gałąź już istnieje, to polecenie zakończy się niepowodzeniem

# BRANCH_QUIET_DESCRIPTION
source: suppresses non-error messages, when creating or deleting a branch
pl: podczas tworzenia lub usuwania gałęzi tłumi komunikaty, które nie są komunikatami o błędach

# BRANCH_SHOW_CURRENT_DESCRIPTION
source: prints the name of the current branch; in detached HEAD state, nothing is printed
pl: drukuje nazwę bieżącej gałęzi; w stanie z odłączoną HEAD nic nie jest drukowane

# PATTERN_META
source: <pattern>
pl: <wzorzec>

# TAG_DELETE_DESCRIPTION
source: deletes existing tags with given names
pl: usuwa istniejące znaczniki o podanych nazwach

# TAG_FORCE_DESCRIPTION
source: forces creation of new tag even, if it already exists
pl: wymusza utworzenie nowego znacznika nawet, jeśli ten już istnieje

# TAG_LIST_DESCRIPTION
source: lists known tags; if any shell wildcard pattern is present, it only shows tags matching the pattern(s); when multiple patterns are given, if any of them matches, the tag is shown
pl: wyświetla znane znaczniki; jeśli istnieje jakikolwiek wzorzec z symbolem wieloznacznym powłoki, pokazuje tylko znaczniki pasujące do wzorca (wzorców); gdy podano wiele wzorów, jeśli którykolwiek z nich pasuje, znacznik jest wyświetlany

# TAG_NAME_DESCRIPTION
source: creates a new tag with given name; if the tag already exists, this command will fail
pl: tworzy nowy znacznik o podanej nazwie; jeśli znacznik już istnieje, to polecenie zakończy się niepowodzeniem
