Repository: mbits-libs/git2-cxx
Catalog: data/translations/cov_report/*.po
Languages: pl

# AMEND_DESCRIPTION
source: replaces the tip of the current branch by creating a new commit
pl: zastępuje końcówkę bieżącej gałęzi, tworząc nowy zapis

# ERROR_AMEND_IN_FRESH_REPO
source: you have nothing to amend
pl: nie masz nic do poprawienia

# ERROR_BARE_GIT
source: this operation must be run in a work tree
pl: ta operacja musi być wykonana w drzewie roboczym

# ERROR_CANNOT_FIND_FILE
source: cannot find {}
pl: nie można znaleźć {}

# ERROR_CANNOT_LOAD_COMMIT
source: cannot find the Git commit from report
pl: nie można znaleźć zapisu Git z raportu

# ERROR_CANNOT_OPEN_FILE
source: could not read {}
pl: nie można odczytać {}

# ERROR_CANNOT_READ_FROM_DB
source: cannot read current report back
pl: nie można odczytać raportu bieżącego

# ERROR_CANNOT_WRITE_TO_DB
source: cannot write to repository database
pl: nie można pisać do bazy danych repozytorium

# ERROR_FILTERED_REPORT_ISSUES
source: there were issues with {} processed by {} filter
pl: wystąpiły problemy z {} przetworzonym przez filtr {}

# ERROR_FILTER_ACCESS
source: filter {} could not be used
pl: nie można użyć filtra {}

# ERROR_FILTER_FAILED
source: filter {} exited with return code {}
pl: filtr {} zakończył się kodem {}

# ERROR_FILTER_NOENT
source: filter {} could not be found
pl: nie można znaleźć filtra {}

# ERROR_REPORT_ISSUES
source: there were issues with {}
pl: wystąpiły problemy z {}

# FILTER_DESCRIPTION
source: filters other report formats to internal cov format; known filters are: {}
pl: filtruje inne formaty raportów do wewnętrznego formatu cov; znane filtry to: {}

# FILTER_DESCRIPTION_LIST_END
source: {} and {}
pl: {} i {}

# FILTER_META
source: <filter>
pl: <filtr>

# MESSAGE_DETACHED_HEAD
source: detached HEAD
pl: odłączone HEAD

# MESSAGE_FIELD_GIT_COMMIT
source: based on
pl: w oparciu o

# MESSAGE_FIELD_PARENT_REPORT
source: parent
pl: rodzic

# MESSAGE_FILE_COUNT
source: {} file
pl: jeden plik

# REPORT_FILE_DESCRIPTION
source: selects report to import
pl: wybiera raport do zaimportowania

# REPORT_FILE_META
source: <report-file>
pl: <plik-raportu>

# WARNING_FILE_MODIFIED
source: {} was modified after the report
pl: {} został zmodyfikowany po raporcie
