Repository: mbits-libs/git2-cxx
Catalog: data/translations/strip_excludes/*.po
Languages: pl

# ARG_COMPILER
source: adds the name of current compiler to list of markers; defaults to '{}'
pl: dodaje nazwę bieżącego kompilatora do listy znaczników; wartość domyślna to '{}'

# ARG_OS
source: adds the name of current platform to list of markers; defaults to '{}'
pl: dodaje nazwę bieżącej platformy do listy znaczników; wartość domyślna to '{}'

# ARG_SRC
source: points to root of source files; defaults to current directory
pl: wskazuje na katalog główny plików źródłowych; wartość domyślna to bieżący katalog

# ARG_VERBOSE
source: shows more output
pl: pokazuje więcej danych wyjściowych

# DETAILS_EXCLUDED
source: excluded
pl: wykluczono

# DETAILS_EXCLUDED_BRANCHES
source: one branch
pl: jedną gałąź

# DETAILS_EXCLUDED_FUNCTIONS
source: one function
pl: jedną funkcję

# DETAILS_EXCLUDED_LINES
source: one line
pl: jedną linię

# DETAILS_MARKERS
source: markers
pl: znaczniki

# DETAILS_SOURCES
source: sources
pl: źródła

# LIST_AND
source: and
pl: i

# REPORT_MISSING_KEY
source: missing '{}' key in report
pl: w raporcie brakuje klucza '{}'
